  /*
    Завдання:
     Копіювати текст із файлу RegExp.txt на сайт https://regexr.com/
     Написати регулярний вираз, який знайде:
       1. Усі слова.
       2. Усі збіги букв від a до e,
       3. Року, наприклад 2004
       4. Слова загорнуті в [квадратні Кавички]
       5. Усі формати файлів .jpg / .png / .gif
       6. Усі email com.ua
       7. Всі слова написані з великої літери
       8. Знайти телефон написаний за патерном +00 (000) 000-00-00,
          де замість 0 може бути будь-яке число
  */